app/controllers/api/v1/events_controller.rb

    def index
        events = Event.all
---
SELECT "events".* FROM "events"

    def show
        event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]